Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF2685.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B4EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B4EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE64">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B4EID0" edc:desc="" edc:mask="0x1" edc:name="B4EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4EID1" edc:desc="" edc:mask="0x1" edc:name="B4EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4EID2" edc:desc="" edc:mask="0x1" edc:name="B4EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4EID3" edc:desc="" edc:mask="0x1" edc:name="B4EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4EID4" edc:desc="" edc:mask="0x1" edc:name="B4EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4EID5" edc:desc="" edc:mask="0x1" edc:name="B4EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4EID6" edc:desc="" edc:mask="0x1" edc:name="B4EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4EID7" edc:desc="" edc:mask="0x1" edc:name="B4EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nrrnnnn" edc:cname="B4DLC" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="B4DLC" edc:nzwidth="0x8" edc:por="-xxxxxxx" edc:_addr="0xE65">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTR_TXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR/TXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="RESRB0" edc:desc="" edc:mask="0x1" edc:name="RESRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESRB1" edc:desc="" edc:mask="0x1" edc:name="RESRB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXRTR" edc:desc="" edc:mask="0x1" edc:name="TXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="RXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B4DLC0" edc:desc="" edc:mask="0x1" edc:name="B4DLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4DLC1" edc:desc="" edc:mask="0x1" edc:name="B4DLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4DLC2" edc:desc="" edc:mask="0x1" edc:name="B4DLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4DLC3" edc:desc="" edc:mask="0x1" edc:name="B4DLC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4RB0" edc:desc="" edc:mask="0x1" edc:name="B4RB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4RB1" edc:desc="" edc:mask="0x1" edc:name="B4RB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4RXRTR" edc:desc="" edc:mask="0x1" edc:name="B4RXRTR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B4D0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B4D0" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE66">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B4D00" edc:desc="" edc:mask="0x1" edc:name="B4D00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D01" edc:desc="" edc:mask="0x1" edc:name="B4D01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D02" edc:desc="" edc:mask="0x1" edc:name="B4D02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D03" edc:desc="" edc:mask="0x1" edc:name="B4D03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D04" edc:desc="" edc:mask="0x1" edc:name="B4D04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D05" edc:desc="" edc:mask="0x1" edc:name="B4D05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D06" edc:desc="" edc:mask="0x1" edc:name="B4D06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D07" edc:desc="" edc:mask="0x1" edc:name="B4D07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
